# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
* Write SQL queries that make use of various types of joins
* Compare and contrast the various types of joins
* Discuss how primary and foreign keys are used in SQL
* Decide and perform whichever type of join is best for retrieving desired data

## CRM Schema

In almost all cases, rather than just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins** using shared columns from the two tables. 

In this lab, you'll use the same customer relationship management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database `'data.sqlite'`.

In [29]:
# Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

In [31]:
cur.execute("""SELECT * FROM employees WHERE officeCode = 2 OR officeCode = 27""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head(20)

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1188,Firrelli,Julie,x2173,jfirrelli@classicmodelcars.com,2,1143,Sales Rep
1,1216,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143,Sales Rep

## Display the names of all the employees in Boston 

Hint: join the employees and offices tables.

In [32]:
# Your code here
cur.execute("""SELECT firstName, lastName FROM employees A JOIN offices B
               WHERE A.officeCode =B.officeCode AND B.city = 'Boston' """)
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head(20)

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by.

In [57]:
# Your code here
cur.execute("""SELECT a.officeCode, a.city, count(b.employeeNumber) AS number_of_emloyees
                FROM offices AS a LEFT JOIN employees AS b
                  USING(officeCode) GROUP BY officeCode""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head(20)

   officeCode           city  number_of_emloyees
0           1  San Francisco                   6
1           2         Boston                   2
2           3            NYC                   2
3           4          Paris                   5
4           5          Tokyo                   2
5           6         Sydney                   4
6           7         London                   2
7          27         Boston                   0

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary
# Display the htmlDescription and employee's first and last name for each product that each employee has sold

In [61]:
# Your code here
# Display employee's employeesNumber, last and first name and customers from particular cities order by employees
cur.execute("""SELECT a.employeeNumber, a.lastName, a.firstName, b.customerName, b.city AS Customer_city 
               FROM employees a JOIN customers b ON (b.salesRepEmployeeNumber = a.employeeNumber)
               GROUP by b.city ORDER BY a.employeeNumber""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head(20)

,employeeNumber,lastName,firstName,customerName,Customer_city
0,1165,Jennings,Leslie,Signal Collectibles Ltd.,Brisbane
1,1165,Jennings,Leslie,Technics Stores Inc.,Burlingame
2,1165,Jennings,Leslie,Corporate Gift Ideas Co.,San Francisco
3,1165,Jennings,Leslie,The Sharp Gifts Warehouse,San Jose
4,1165,Jennings,Leslie,Mini Gifts Distributors Ltd.,San Rafael
5,1166,Thompson,Leslie,West Coast Collectables Co.,Burbank
6,1166,Thompson,Leslie,Boards & Toys Co.,Glendale
7,1166,Thompson,Leslie,Signal Gift Stores,Las Vegas
8,1166,Thompson,Leslie,"Men 'R' US Retailers, Ltd.",Los Angeles
9,1166,Thompson,Leslie,Toys4GrownUps.com,Pasadena
10,1166,Thompson,Leslie,Collectable Mini Designs Co.,San Diego
11,1188,Firrelli,Julie,Diecast Collectables,Boston
12,1188,Firrelli,Julie,Collectables For Less Inc.,Brickhaven
13,1188,Firrelli,Julie,Cambridge Collectables Co.,Cambridge
14,1188,Firrelli,Julie,Mini Creations Ltd.,New Bedford
15,1188,Firrelli,Julie,"Classic Gift Ideas, Inc",Philadelphia
16,1216,Patterson,Steve,Diecast Classics Inc.,Allentown
17,1216,Patterson,Steve,Online Diecast Creations Co.,Nashua
18,1286,Tseng,Foon Yue,Québec Home Shopping Network,Montréal
19,1286,Tseng,Foon Yue,Classic Legends Inc.,NYC

In [67]:
# Your code here
#Display the htmlDescription and employee's first and last name for each product that each employee has sold 
cur.execute("""SELECT lastName, firstName, count(productName) 
               FROM employees e
               JOIN customers c
                   ON e.employeeNumber = c.salesRepEmployeeNumber
               JOIN orders o
                   USING (customerNumber)
               JOIN orderdetails od
                   USING (orderNumber)
               JOIN products p
                   USING (productCode)
            GROUP BY lastName
            ORDER BY lastName, 
            firstName""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
print(df)

     lastName firstName  count(productName)
0      Fixter      Andy                 185
1       Jones     Barry                 220
2       Tseng  Foon Yue                 142
3      Vanauf    George                 211
4   Hernandez    Gerard                 396
5    Firrelli     Julie                 124
6        Bott     Larry                 236
7    Jennings    Leslie                 331
8    Thompson    Leslie                 114
9      Bondur      Loui                 177
10      Nishi      Mami                 137
11     Gerard    Martin                 114
12   Castillo    Pamela                 272
13      Marsh     Peter                 185
14  Patterson     Steve                 152

In [ ]:
cur.execute("""SELECT firstName, lastName, productName
               FROM employees e
               JOIN customers c
               ON e.employeeNumber = c.salesRepEmployeeNumber
               JOIN orders o
               USING(customerNumber)
               JOIN orderdetails od
               USING(orderNumber)
               JOIN products p
               USING(productCode)""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print(len(df))
df.head()

In [ ]:
# Your code here

## Level Up: Display the names of every individual product that each employee has sold

In [ ]:
# Your code here

## Level Up: Display the Number of Products each employee has sold

In [ ]:
# Your code here

## Summary

Congrats! You practiced using join statements and leveraged your foreign keys knowledge!